namespace HW3_Task_3_Ranges
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //            Завдання 3
            //Використовуючи Visual Studio, створіть проект за шаблоном Console Application.
            //Напишіть програму визначення, чи потрапляє вказане користувачем число від 0 до 100 в числовий
            //проміжок[0 - 14][15 - 35][36 - 50][50 - 100].Якщо так, то вкажіть, в який саме проміжок.Якщо
            //користувач вказує число, що не входить ні в один з наявних числових проміжків , то виводиться
            //відповідне повідомлення.
        }
    }
}
